{
  "stories": {
    "worldview_intro": {
      "id": "worldview_intro",
      "type": "default",
      "title": "Introduction to Worldview",
      "description": "Discover and learn how to use Worldview's tools and features!",
      "backgroundImage": "wv_intro.png",
      "backgroundImageHover": "",
      "readMoreLinks": [
        {
          "title": "Getting Started with Worldview (December 2021 Video Tutorial)",
          "link": "https://youtu.be/uMkuiRJr_-E"
        },
        {
          "title": "NASA Worldview - Explore the Earth from Past to Present with Global Satellite Observations (May 2021 Webinar Video)",
          "link": "https://youtu.be/WqkX-b-jYGI"
        }
      ],
      "steps": [
        {
          "id": "001",
          "description": "step001.html",
          "stepLink": "v=-108.00920361862684,-63.57842410029712,116.2759949373298,68.07713930391033",
          "joyride": {
            "continuous": true,
            "spotlightClicks": true,
            "steps": [
              {
                "target": "#productsHolder",
                "content": "To start, let's explore the Layers, Events and Data tabs.",
                "placement": "right-start"
              },
              {
                "target": "#layers-sidebar-tab",
                "title": "Layer List",
                "content": "The Layer List shows all the imagery layers that are loaded on the map. Base layers appear under the overlays and only the topmost active base layer will display. Toggle on and off the layers by clicking on the \"eye\" icon to the left of the layer name.",
                "spotlightClicks": false,
                "disableOverlayClose": true,
                "placementBeacon": "bottom"
              },
              {
                "target": "#events-sidebar-tab",
                "title": "Events",
                "content": "Select the Events tab to view a curated list of current and historical natural events around the world.",
                "spotlightClicks": false,
                "disableOverlayClose": true,
                "placementBeacon": "bottom"
              },
              {
                "target": "#download-sidebar-tab",
                "title": "Data Download",
                "content": "Select the Data tab to download the underlying data for the imagery layers displayed on the map. You will be directed to the Earthdata Search tool to download data granules of the selected layer, chosen area of interest, and current date.",
                "spotlightClicks": false,
                "disableOverlayClose": true,
                "placementBeacon": "bottom"
              },
              {
                "target": "#layers-add",
                "title": "Layer Picker",
                "content": "The Layer Picker allows you to browse and search over 1000 imagery layers by science discipline, hazards and disasters categories, or by keyword.",
                "placementBeacon": "top"
              },
              {
                "target": "#compare-toggle-button",
                "title": "Comparison",
                "content": "Compare imagery from two different dates, or two sets of imagery from the same date or even two sets of imagery from different dates!",
                "placementBeacon": "top"
              },
              {
                "target": "#date-selector-main",
                "title": "Date Selector",
                "content": "Change the date (and time of day if you have Geostationary layers loaded) by typing into the date fields, or by clicking on the up and down arrows by each field.",
                "placementBeacon": "top"
              },
            {
              "target": "#zoom-buttons-group",
              "title": "Interval Selector",
              "content": "Select the desired timeline interval and use the left and right arrows to step backward or forward in time according to the selected interval. Use the far right arrow to go to the latest available date.",
              "placementBeacon": "top"
            },
              {
                "target": "#animate-button",
                "title": "Animation",
                "content": "Animate the imagery by clicking on the video camera icon. Click on the Play button to watch the imagery change. You can also select an area to export as an animated GIF.",
                "placementBeacon": "top"
              },
              {
                "target": "#timeline-layer-coverage-panel-handle",
                "title": "Timeline Layer Coverage Panel",
                "content": "To open the timeline layer coverage panel, click on the double chevrons. Temporal availability of active time-varying layers are shown as a set of striped horizontal blue lines in the panel. The total temporal coverage of the layers is shown on the far right.",
                "spotlightClicks": false,
                "disableOverlayClose": true,
                "placementBeacon": "top"
              },
              {
                "target": ".zoom-level-change",
                "title": "Timescale Zoom",
                "content": "Adjust the timescale to years, months, and days (and, hours and minutes if you have a Geostationary layer loaded).",
                "placementBeacon": "top"
              },
              {
                "target": "#ol-coords-case",
                "title": "Map Coordinates",
                "content": "When hovering over the map, coordinates are shown here. In tour mode, hover your cursor here to see coordinates. Click on the coordinates to change between common formats like Degrees Minutes Seconds, Decimal Degrees, and Degrees Decimal Minutes.",
                "placementBeacon": "top"
              },
              {
                "target": "#wv-measure-button",
                "title": "Measure",
                "content": "Measure Distance and Area in kilometers (km) or miles (mi) and export as GeoJSON.",
                "placementBeacon": "top"
              },
              {
                "target": "#location-search-wrapper",
                "content": "Search by location name or coordinates which then places a marker on the map. Conversely, place a marker on the map to find out the place name and coordinates.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-share-button",
                "content": "Create a custom URL link of your Worldview page, copy HTML code to embed Worldview into a web page, and share Worldview via social media with friends and colleagues!",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-proj-button",
                "content": "Change the map projection from Geographic to Arctic or Antarctic.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-image-button",
                "content": "Take a snapshot of the imagery shown on the map and export the imagery as  GeoTIFF, JPG with Worldfile, PNG with Worldfile, and KMZ and bring it straight into GIS clients.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-info-button",
                "content": "Click here to provide feedback, explore the app through self-guided tours (like this one!), view service notifications, change global/app-wide settings (just temperature units for now!), and find out more about developing the Worldview application by checking out the open source code. You can also access Distraction Free mode, which hides most of the application so you can focus solely on the map imagery.",
                "placementBeacon": "bottom"
              }
            ]
          }
        }
      ]
    }
  }
}