{
  "stories": {
    "worldview_intro": {
      "id": "worldview_intro",
      "type": "default",
      "title": "Introduction to Worldview",
      "description": "Discover and learn how to use Worldview's tools and features!",
      "backgroundImage": "wv_intro.png",
      "backgroundImageHover": "",
      "readMoreLinks": [],
      "steps": [
        {
          "id": "001",
          "description": "step001.html",
          "stepLink": "v=-108.00920361862684,-63.57842410029712,116.2759949373298,68.07713930391033",
          "joyride": {
            "continuous": true,
            "spotlightClicks": true,
            "steps": [
              {
                "target": "#productsHolder",
                "content": "To start, let's explore the Layers, Events and Data tabs.",
                "placement": "right-start"
              },
              {
                "target": "#layers-sidebar-tab",
                "title": "Layer List",
                "content": "The Layer List shows all the imagery layers that are loaded on the map. Base layers appear under the overlays and only the top most activated base layer will display.",
                "placementBeacon": "top"
              },
              {
                "target": "#events-sidebar-tab",
                "title": "Events",
                "content": "Select the Events tab to view a curated list of current natural events around the world.",
                "placementBeacon": "right"
              },
              {
                "target": "#download-sidebar-tab",
                "title": "Data Download",
                "content": "Select the Data tab to download the underlying data for the imagery layers displayed on the map. Once you have selected your desired layer, it will direct you to the Earthdata Search tool to download the data.",
                "placementBeacon": "right"
              },
              {
                "target": "#timeline",
                "title": "Timeline",
                "content": "The Timeline allows you to choose the date of observation and much more!",
                "placementBeacon": "right"
              },
              {
                "target": "#date-selector-main",
                "title": "Date Selector",
                "content": "Change the date (and time if you have Geostationary layers loaded) by selecting and typing into the date fields, clicking on the up and down arrows by each field.",
                "placementBeacon": "right"
              },
              {
              "target": "#timeline-interval-btn-container",
              "title": "Interval Selector",
              "content": "Select the timeline interval you are interested in, or set your own.",
              "placementBeacon": "right"
            },
            {
              "target": "#zoom-buttons-group",
              "content": "Use the back and forward arrows to step backward or forward in time according to the selected interval.",
              "placementBeacon": "right"
            },
              {
                "target": "#animate-button",
                "title": "Timeline Animation",
                "content": "Animate the imagery by clicking on the video camera icon. Click on Play in the animation box to watch the imagery change day by day. You can even  export it as an animated GIF.",
                "placementBeacon": "right"
              },
              {
                "target": "#timeline-layer-coverage-panel-handle",
                "title": "Timeline Layer Coverage",
                "content": "Click here to open the timeline layer coverage panel. Temporal availability of active time-varying layers are shown as a set of striped horizontal blue lines in the panel. The total temporal coverage of the layers is shown on the far right.",
                "placementBeacon": "right"
              },
              {
                "target": ".zoom-level-change",
                "title": "Timescale Zoom",
                "content": "Adjust the timeline view to view the timescale in years, months, and days (And, hours and minutes if you have a Geostationary layer loaded).",
                "placementBeacon": "right"
              },
              {
                "target": "#location-search-wrapper",
                "content": "Use Location Search by entering a place name or coordinates to place a map marker on the map. Conversely, place a map marker on the map to find out the place name and coordinates.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-link-button",
                "content": "Save the URL of the current state of the site and share it with others!",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-proj-button",
                "content": "The \"Globe\" icon allows you to change the projection from Geographic to Arctic or Antarctic.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-image-button",
                "content": "The \"Camera\" icon allows you to take a snapshot of the imagery shown on the map and export the imagery to GIS clients.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-info-button",
                "content": "Here you may provide feedback, initiate tour stories, find out what we've been working on recently and learn more about Worldview. You can also access the Distraction Free mode which removes all of the unnecessary elements so you can focus solely on the map.",
                "placementBeacon": "bottom"
              },
              {
                "target": "#wv-measure-button",
                "content": "Measure Distance and Area in kilometers (km) or miles (mi) and export as GeoJSON.",
                "placementBeacon": "left"
              },
              {
                "target": "#ol-coords-case",
                "content": "When outside of the tour mode, you can hover the cursor on the map and see map coordinates here. Click on the coordinates box to change map coordinates between Degrees Minutes Seconds, Decimal Degrees, and Degrees Decimal Minutes.",
                "placementBeacon": "left"
              }
            ]
          }
        }
      ]
    }
  }
}
